2/0.org/S
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            groovyBC;

        variables       "y=pos().y;";

        valueExpression "y < -0.0025 ? 0 : y < 0.0025 ? 1 : 0";
        gradientExpression "0";
        fractionExpression "1";

        value           uniform 0;
    }
    side
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
    front
    {   
        type            zeroGradient;
    }
    back 
    {   
        type            zeroGradient;
    }
}

// ************************************************************************* //
